Final_Case/Initial_SparseGrid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          63;
        startFace       4874;
    }
    outlet
    {
        type            patch;
        nFaces          63;
        startFace       4937;
    }
    lowerSymmetry
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          30;
        startFace       5000;
    }
    obstical
    {
        type            wall;
        inGroups        1(wall);
        nFaces          16;
        startFace       5030;
    }
    top
    {
        type            patch;
        nFaces          40;
        startFace       5046;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4980;
        startFace       5086;
    }
)

// ************************************************************************* //
